Mikail-Sadic-UT/POV-Globe/Firmware/src/Drivers/src/esp8266_full.c
// esp8266.c
// Driver for ESP8266 module to act as a WiFi client or server
// Currently restricted to one incoming or outgoing connection at a time
//
// Steven Prickett (steven.prickett@gmail.com)
// Modified version by Dung Nguyen, Wally Guzman
// Modified by Jonathan Valvano, March 28, 2017
// Consolidated by Andreas Gerstlauer, April 6, 2020 

/* 
  THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
  OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
  VALVANO SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
  OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
*/

// NOTE: ESP8266 resources below:
// General info and AT commands: http://nurdspace.nl/ESP8266
// General info and AT commands: http://www.electrodragon.com/w/Wi07c
// Community forum: http://www.esp8266.com/
// Offical forum: http://bbs.espressif.com/
// Example: http://zeflo.com/2014/esp8266-weather-display/
// Flashing: http://www.xess.com/blog/esp8266-reflash/

/* Hardware connections
 Vcc is a separate regulated 3.3V supply with at least 215mA
 /------------------------------\
 |              chip      1   8 |
 | Ant                    2   7 |
 | enna       processor   3   6 |
 |                        4   5 |
 \------------------------------/ 
 Connects (#define below) TM4C123 on either UART1 (PB) or UART2 (PD)
 Reset (#define below) on either PB5 or PB1
 
 ESP8266    TM4C123 
  1 URxD    PB1/PD7   UART out of TM4C123, 115200 baud
  2 GPIO0             +3.3V for normal operation (ground to flash)
  3 GPIO2             +3.3V
  4 GND     Gnd       GND (70mA)
  5 UTxD    PB0/PD6   UART out of ESP8266, 115200 baud
  6 Ch_PD             chip select, 10k resistor to 3.3V
  7 Reset   PB5/PB1   TM4C123 can issue output low to cause hardware reset
  8 Vcc               regulated 3.3V supply with at least 70mA
 */


 /////// IMPORTANT, NO CLUE HOW THIS ACTUAALLY WORKS, HAD TO COMMENT A FEW LINES OUT TO MAKE IT NOT MAD (UART_OutCharNonBlock()) - mika ////////



#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include "../inc/tm4c123gh6pm.h"
#include "../inc/CortexM.h"
#include "../inc/FIFO.h"
#include "../inc/UART0int.h"
//#include "../inc/esp8266.h"
#include "../inc/WifiSettings.h"  // access point parameters
#include "../inc/esp8266_base.h"

/*
===========================================================
==========          CONSTANTS                    ==========
===========================================================
*/

#define ESP8266_PB_RST   5  // PB5
// #define ESP8266_PB_RST   1  // PB1

//#define ESP8266_UART     1   // UART1: PB1/PB0
#define ESP8266_UART     2   // UART2: PD7/PB6

//#define USE_UART_DRV  // Use external UART driver (only works with UART1)

#define FIFOSIZE    1024      // size of the FIFOs (must be power of 2)
#define FIFOSUCCESS 1         // return value on success
#define FIFOFAIL    0         // return value on failure

#define MAXTRY 1              // number of attempts to send command

// ESP responses
static const char ESP8266_READY_RESPONSE[] = "\r\nready\r\n";
static const char ESP8266_OK_RESPONSE[] = "\r\nOK\r\n";
static const char ESP8266_ERROR_RESPONSE[] = "\r\nERROR\r\n";
static const char ESP8266_FAIL_RESPONSE[] = "\r\nFAIL\r\n";
static const char ESP8266_SENDOK_RESPONSE[] = "\r\nSEND OK\r\n";

/*
=============================================================
==========            GLOBAL VARIABLES             ==========
=============================================================
*/

// Globals for UART driver
bool ESP8266_EchoResponse = false;
bool ESP8266_EchoCommand = false;

// UART receive control/data & transmit FIFOs (see FIFO.h)
AddIndexFifo(ESP8266Rx, FIFOSIZE, char, FIFOSUCCESS, FIFOFAIL)
AddIndexFifo(ESP8266Rx0, FIFOSIZE, char, FIFOSUCCESS, FIFOFAIL)
#ifndef USE_UART_DRV  
AddIndexFifo(ESP8266Tx, FIFOSIZE, char, FIFOSUCCESS, FIFOFAIL)
#endif

// ESP8266 state
uint16_t ESP8266_Server = 0;   // server port, if any   
uint16_t ESP8266_ConnectionMux = 0;
uint16_t ESP8266_Segment = 0;  // last segment ID for buffered send

/*
=======================================================================
==========              helper FUNCTIONS                     ==========
=======================================================================
*/

// make letter lower-case
char lc(char letter){
  if((letter>='A')&&(letter<='Z')) letter |= 0x20;
  return letter;
}

//---------DelayMs-----
// Busy wait n milliseconds
// Input: time to wait in msec
// Outputs: none
void DelayMs(uint32_t n){
  volatile uint32_t time;
  while(n){
    time = 6665;  // 1msec, tuned at 80 MHz
    while(time){
      time--;
    }
    n--;
  }
}

const char ReceiveDataSearchString[]="+IPD,";
static uint32_t ReceiveDataSearchIndex = 0;
static uint32_t ReceiveDataState = 1;     // 0 to disable filtering
static uint32_t ReceiveDataStream = 0;    // connection ID for received data
static uint32_t ReceiveDataLen = 0;       // receive data packet remaining size
volatile uint32_t ESP8266_DataAvailable = 0;  // received data (about to be) available
volatile uint32_t ESP8266_DataLoss = 0;       // lost data (for debugging)

//-------------------ReceiveDataFilter -------------------
// State machine to filter out received data stream from UART Rx input
// Inputs: character to check 
// Outputs: true if data was filtered out, false otherwise
bool ReceiveDataFilter(char letter){
  switch(ReceiveDataState) {  // Filter FSM
    case 4:   // filter out data and put it into the right receive FIFO
      if(ReceiveDataLen) {
        switch(ReceiveDataStream) {
          case 0: if(ESP8266Rx0Fifo_Put(letter) == FIFOFAIL){  // overflow, data loss
                    ESP8266_DataAvailable--;
                    ESP8266_DataLoss++;
                  } 
                  break;  
          // only one connection currently supported
        }          
        ReceiveDataLen--;
        return true;
      }
      ReceiveDataState = 1;   // restart    
      // fall through to start searching again if data is done
    case 1:  // Look for +IPD
      if (letter == ReceiveDataSearchString[ReceiveDataSearchIndex]){ // match letter?
        ReceiveDataSearchIndex++;
        if(ReceiveDataSearchString[ReceiveDataSearchIndex] == 0){ // end of match string?
          if(ESP8266_ConnectionMux) {
            ReceiveDataState = 2;
          } else {
            ReceiveDataState = 3;
          }
          ReceiveDataSearchIndex = 0;
          ReceiveDataStream = 0;
          ReceiveDataLen = 0;
        }
      } else {
        ReceiveDataSearchIndex = 0; // start over
      }
      return false;
    case 2:  // look for connection ID (separated by comma)
      if(letter >= '0' && letter <= '9') {
        ReceiveDataStream = ReceiveDataStream * 10 + (letter - '0');  // add digit to ID    
      } else if (letter == ',') {
        ReceiveDataState = 3;   // ID completed, move on
      } else {
        ReceiveDataStream = 0;
        ReceiveDataState = 1;   // error, start over
      }
      return false;
    case 3:   // look for receive data size (separated by colon)
      if(letter >= '0' && letter <= '9') {
        ReceiveDataLen = ReceiveDataLen * 10 + (letter - '0');  // add digit to length    
      } else if(letter == ':') {
        ReceiveDataState = 4;   // size complete, move on
        ESP8266_DataAvailable += ReceiveDataLen; // mark as becoming available
      } else {
        ReceiveDataStream = 0;
        ReceiveDataLen = 0;
        ReceiveDataState = 1;   // error, start over
      }
      return false;
  } 
  return false;
}

