Mikail-Sadic-UT/POV-Globe/Firmware/src/Drivers/src/esp8266_full.c
/*
======================================================================
==========         UART and private FUNCTIONS               ==========
======================================================================
*/

// Preprocessor magic to construct UARTx_ identifiers
#define STR(x)  #x
#define CONCAT(x,y,z) x ## y ## z

#define UART_STR(uart)  "UART" STR(uart) 
#define UART_NAME(uart,identifier)  CONCAT(UART,uart,identifier)

#define UART_ESP8266(identifier) UART_NAME(ESP8266_UART,identifier)

#ifdef USE_UART_DRV

#if ESP8266_UART==1
#include "../inc/UART1.h"
#elif ESP8266_UART==2
#include "../inc/UART2.h"
#endif

//--------ESP8266_InitUart--------
// Intializes uart needed to communicate with esp8266
// Configure UART for 115200bps operation
// Inputs: none
// Outputs: none
void ESP8266_InitUART(int rx_echo, int tx_echo){ 
  ESP8266RxFifo_Init();
  ESP8266Rx0Fifo_Init();  
  ESP8266_EchoResponse = rx_echo;
  ESP8266_EchoCommand = tx_echo;
  UART_ESP8266(_Init)(BAUDRATE);
}

//--------ESP8266_OutChar--------
// Prints a character to the esp8226 via uart
// Inputs: character to transmit
// Outputs: none
void ESP8266_OutChar(char data){
    UART_ESP8266(_OutChar)(data);
    if(ESP8266_EchoCommand) UART_OutChar(data); // echo debugging
}

//--------ESP8266_EnableInterrupt--------
// Enables uart interrupt
// Inputs: none
// Outputs: none
void ESP8266_EnableInterrupt(void){
  UART_ESP8266(_EnableRXInterrupt)();
}

//--------ESP8266_DisableInterrupt--------
// Disables uart interrupt
// Inputs: none
// Outputs: none
void ESP8266_DisableInterrupt(void){
  UART_ESP8266(_DisableRXInterrupt)();
}
//#define DSIZE 64
//char dbuf[DSIZE];
//int dcnt=0;
//----------ESP8266RxToBuffer----------
// Copies uart fifo to RX buffer (software defined FIFO)
// Inputs: none
// Outputs:none
void static ESP8266RxToBuffer(void){
  char letter;
  while(((UART_ESP8266(_FR_R)&UART_FR_RXFE) == 0) && (ESP8266RxFifo_Size() < (FIFOSIZE - 1))){
    letter = UART_ESP8266(_DR_R);
//    dbuf[dcnt] = letter;
//    dcnt = (dcnt+1)&(DSIZE-1);
    if(ESP8266_EchoResponse){
      // UART_OutCharNonBlock(letter); // echo
    }
    if(!ReceiveDataFilter(letter)) {
      ESP8266RxFifo_Put(letter);
    }
  }
}

//----------UART_Handler----------
// At least one of three things has happened:
// hardware RX FIFO goes from 1 to 2 or more items
// UART receiver has timed out
void UART_ESP8266(_Handler)(void){
  if(UART_ESP8266(_RIS_R)&UART_RIS_RXRIS){       // hardware RX FIFO >= 2 items
    UART_ESP8266(_ICR_R) = UART_ICR_RXIC;        // acknowledge RX FIFO
    ESP8266RxToBuffer();
  }
  if(UART_ESP8266(_RIS_R)&UART_RIS_RTRIS){       // receiver timed out
    UART_ESP8266(_ICR_R) = UART_ICR_RTIC;        // acknowledge receiver time out
    ESP8266RxToBuffer();
  }
}

#else

//------------------- ESP8266InitUART-------------------
// Intializes uart needed to communicate with esp8266
// Configure UART for 115200bps operation
// Inputs: RX and/or TX echo for debugging
// Outputs: none
void ESP8266_InitUART(int rx_echo, int tx_echo){ volatile int delay;
  ESP8266TxFifo_Init();
  ESP8266RxFifo_Init();
  ESP8266Rx0Fifo_Init();  
  ESP8266_EchoResponse = rx_echo;
  ESP8266_EchoCommand = tx_echo;
#if ESP8266_UART==1
  SYSCTL_RCGCUART_R |= 0x02; // Enable UART1
  while((SYSCTL_PRUART_R&0x02)==0){};
  SYSCTL_RCGCGPIO_R |= 0x02; // Enable PORT B clock gating
  while((SYSCTL_PRGPIO_R&0x02)==0){};
  GPIO_PORTB_AFSEL_R |= 0x03;
  GPIO_PORTB_PCTL_R =(GPIO_PORTB_PCTL_R&0xFF0FFF00)|0x00000011;
  GPIO_PORTB_DEN_R   |= 0x23; //23
  GPIO_PORTB_DATA_R |= 0x20; // reset high
#else
  SYSCTL_RCGCUART_R |= 0x04; // Enable UART2
  while((SYSCTL_PRUART_R&0x04)==0){};
  SYSCTL_RCGCGPIO_R |= 0x0A; // Enable PORT B,D clock gating
  while((SYSCTL_PRGPIO_R&0x08)==0){}; 
  GPIO_PORTD_LOCK_R = 0x4C4F434B;   // 2) unlock GPIO Port D
  GPIO_PORTD_CR_R = 0xFF;           // allow changes to PD7
  GPIO_PORTD_AFSEL_R |= 0xC0; // PD7,PD6 UART2
  GPIO_PORTD_PCTL_R =(GPIO_PORTD_PCTL_R&0x00FFFFFF)|0x11000000;
  GPIO_PORTD_DEN_R   |= 0xC0; //PD6,PD7 UART2 
#endif  
  UART_ESP8266(_CTL_R) &= ~UART_CTL_UARTEN;                  // Clear UART enable bit during config
  UART_ESP8266(_IBRD_R) = (80000000/16)/BAUDRATE;   
  UART_ESP8266(_FBRD_R) = ((64*((80000000/16)%BAUDRATE))+BAUDRATE/2)/BAUDRATE;      
// UART_ESP8266(_IBRD_R) = 43;   // IBRD = int(80,000,000 / (16 * 115,200)) = int(43.403)
// UART_ESP8266(_FBRD_R) = 26;   // FBRD = round(0.4028 * 64 ) = 26
  UART_ESP8266(_LCRH_R) = (UART_LCRH_WLEN_8|UART_LCRH_FEN);  // 8 bit word length, 1 stop, no parity, FIFOs enabled
  UART_ESP8266(_IFLS_R) &= ~0x3F;                            // Clear TX and RX interrupt FIFO level fields
  UART_ESP8266(_IFLS_R) += (UART_IFLS_TX1_8|UART_IFLS_RX1_8);// RX and TX FIFO interrupt threshold >= 1/8th full
  UART_ESP8266(_IM_R)  |= (UART_IM_RXIM|UART_IM_TXIM|UART_IM_RTIM); // Enable interupt on TX, RX and RX transmission end
  UART_ESP8266(_CTL_R) |= (UART_CTL_UARTEN|UART_CTL_RXE|UART_CTL_TXE); // Set UART enable bit 
}

//--------ESP8266_EnableInterrupt--------
// Enables uart interrupt
// Inputs: none
// Outputs: none
void ESP8266_EnableInterrupt(void){
#if ESP8266_UART==1
  NVIC_PRI1_R = (NVIC_PRI1_R&0xFF00FFFF)|0x00400000; // bits 21-23
  NVIC_EN0_R = 1<<6;           // enable interrupt 6 in NVIC
#else
  NVIC_PRI8_R = (NVIC_PRI1_R&0xFFFF00FF)|0x00004000; // bits 15-13
  NVIC_EN1_R = 1<<1;           // enable interrupt 33 in NVIC
#endif    
}

//--------ESP8266_DisableInterrupt--------
// Disables uart interrupt
// Inputs: none
// Outputs: none
void ESP8266_DisableInterrupt(void){
#if ESP8266_UART==1
  NVIC_DIS0_R = 1<<6;           // disable interrupt 6 in NVIC
#else
  NVIC_DIS1_R = 1<<1;           // disable interrupt 33 in NVIC
#endif    
}

//----------ESP8266BufferToTx----------
// Copies TX buffer (software defined FIFO) to uart
// Inputs: none
// Outputs:none
void static ESP8266BufferToTx(void){
  char letter;
  while(((UART_ESP8266(_FR_R)&UART_FR_TXFF) == 0) && (ESP8266TxFifo_Size() > 0)){
    ESP8266TxFifo_Get(&letter);
    if(ESP8266_EchoCommand){
      // UART_OutCharNonBlock(letter); // echo
    }
    UART_ESP8266(_DR_R) = letter;
  }
}

