Mikail-Sadic-UT/POV-Globe/Firmware/src/Drivers/src/esp8266_full.c
//----------ESP8266RxToBuffer----------
// Copies uart fifo to RX buffer (software defined FIFO)
// Inputs: none
// Outputs:none
void static ESP8266RxToBuffer(void){
  char letter;
  while(((UART_ESP8266(_FR_R)&UART_FR_RXFE) == 0) && (ESP8266RxFifo_Size() < (FIFOSIZE - 1))){
    letter = UART_ESP8266(_DR_R);
    if(ESP8266_EchoResponse){
      // UART_OutCharNonBlock(letter); // echo
    }
    if(!ReceiveDataFilter(letter)) {
      ESP8266RxFifo_Put(letter);
    }
  }
}

//----------UART_Handler----------
// At least one of three things has happened:
// hardware TX FIFO goes from 3 to 2 or less items
// hardware RX FIFO goes from 1 to 2 or more items
// UART receiver has timed out
void UART_ESP8266(_Handler)(void){
  if(UART_ESP8266(_RIS_R)&UART_RIS_TXRIS){       // hardware TX FIFO <= 2 items
    UART_ESP8266(_ICR_R) = UART_ICR_TXIC;        // acknowledge TX FIFO
    ESP8266BufferToTx();
    if(ESP8266TxFifo_Size() == 0){               // software TX FIFO is empty
      UART_ESP8266(_IM_R) &= ~UART_IM_TXIM;      // disable TX FIFO interrupt
    }
  }
  if(UART_ESP8266(_RIS_R)&UART_RIS_RXRIS){       // hardware RX FIFO >= 2 items
    UART_ESP8266(_ICR_R) = UART_ICR_RXIC;        // acknowledge RX FIFO
    ESP8266RxToBuffer();
  }
  if(UART_ESP8266(_RIS_R)&UART_RIS_RTRIS){       // receiver timed out
    UART_ESP8266(_ICR_R) = UART_ICR_RTIC;        // acknowledge receiver time out
    ESP8266RxToBuffer();
  }
}

//--------ESP8266_OutChar--------
// Prints a character to the esp8226 via uart
// Inputs: character to transmit
// Outputs: none
void ESP8266_OutChar(char data){
  while(ESP8266TxFifo_Put(data) == FIFOFAIL){};
  UART_ESP8266(_IM_R) &= ~UART_IM_TXIM;          // disable TX FIFO interrupt
  ESP8266BufferToTx();
  UART_ESP8266(_IM_R) |= UART_IM_TXIM;           // enable TX FIFO interrupt
}

#endif

//--------ESP8266_InChar--------
// Read a character from the esp8226 via uart
// Inputs: none
// Outputs: character received
char ESP8266_InChar(void){ char letter;
  while(ESP8266RxFifo_Get(&letter) == FIFOFAIL){};
  return(letter);
}

//---------ESP8266_SendCommand-----
// Sends a string to the esp8266 module
// Inputs: string to send (null-terminated)
// Outputs: none
void ESP8266_SendCommand(const char* command){
  int index = 0;
  while(command[index] != 0){
    ESP8266_OutChar(command[index++]);
  }
}

//---------ESP8266_WaitForResponse-----
// Busy-wait until response found
// Inputs: Success or failure strings to search for
// Outputs: 1 on success, 0 on failure
int ESP8266_WaitForResponse(const char *success, const char* failure) {
  char d;
  const char *s = success;
  const char *f = failure;
  while((!s || *s) && (!f || *f)) {   // end of search string reached?
    d = ESP8266_InChar(); 
    if(s && (d == *s)) {
      s++;
    } else {
      s = success;  // start over
      if(s && (d == *s)) s++;  // match first char?
    }
    if(f && (d == *f)) {
      f++;
    } else {
      f = failure;  // start over
      if(f && (d == *f)) f++;  // match first char? 
    }
  }
  if(failure && !(*f)) return FAILURE;
  return SUCCESS;  
}

/*
=======================================================================
==========          ESP8266 PUBLIC FUNCTIONS                 ==========
=======================================================================
*/

//-------------------ESP8266_Init --------------
// Initializes the module
// Inputs: RX and/or TX echo for debugging
// Outputs: 1 for success, 0 for failure (no ESP detected)
int ESP8266_Init(int rx_echo, int tx_echo){ char c; const char* s; uint32_t timer = 1;
  // Disable interrupt during initialization
  ESP8266_DisableInterrupt();
  SYSCTL_RCGCGPIO_R |= 0x02; // Port B has reset signal

  // Initialize UART to communicate with ESP
  ESP8266_InitUART(rx_echo, tx_echo);
  
  // Initialize reset port
  GPIO_PORTB_DIR_R |= (0x01 << ESP8266_PB_RST); // PB output to reset
  GPIO_PORTB_PCTL_R =GPIO_PORTB_PCTL_R & ~(0x0F << (ESP8266_PB_RST*4));
  GPIO_PORTB_DEN_R |= (0x01 << ESP8266_PB_RST); //PB output 

  // Hard reset
  GPIO_PORTB_DATA_R &= ~(0x01 << ESP8266_PB_RST); // reset low
  DelayMs(10);
  GPIO_PORTB_DATA_R |= (0x01 << ESP8266_PB_RST); // reset high
  
  // Wait for ready status with timeout
  // Use low-level UART communication, interrupts disabled
  s = ESP8266_READY_RESPONSE;
  timer = 5000000;  // around a 1-2s total timeout
  while(*s) {
    while(timer && ((UART_ESP8266(_FR_R)&UART_FR_RXFE) != 0)) { timer--; }
    if(!timer) break;  
    c = (char)(UART_ESP8266(_DR_R)&0xFF);
    // if(rx_echo) UART_OutCharNonBlock(c); // echo, requires UART0 to be operational, will print garbage
    if(c == *s) {
      s++;
    } else {
      s = ESP8266_READY_RESPONSE;
      if(c == *s) s++;
    }
  }
  
  // Finally enable interrupt
  ESP8266_EnableInterrupt();
  
  if(!timer) return FAILURE;
  return SUCCESS;
}

//-------------------ESP8266_Connect --------------
// Bring interface up and connect to Wifi
// Inputs: enable debug output
// Outputs: 1 on success, 0 on failure
int ESP8266_Connect(int verbose){
  if(ESP8266_Reset()==FAILURE) return FAILURE; 
    
  if(verbose)  // debug output: MAC address oF ESP8266
    ESP8266_GetMACAddress(); 

#if SOFTAP
  if(ESP8266_SoftAccessPoint(SSID_NAME,PASSKEY)==FAILURE) return FAILURE; 
  if(ESP8266_SetWifiMode(ESP8266_WIFI_MODE_AP)==FAILURE) return FAILURE; 
#else
  if(ESP8266_SetWifiMode(ESP8266_WIFI_MODE_CLIENT)==FAILURE) return FAILURE; 

  if(verbose)  // debug output: see APs in area
    ESP8266_ListAccessPoints(); 
  
  if(ESP8266_JoinAccessPoint(SSID_NAME,PASSKEY)==FAILURE) return FAILURE; 
#endif

  if(verbose)  // debug output: our IP address
    ESP8266_GetIPAddress();
  
  return SUCCESS;
}

//-------------------ESP8266_StartServer --------------
// Start server on specific port
// Inputs: port and server timeout
// Outputs: 1 on success, 0 on failure
int ESP8266_StartServer(uint16_t port, uint16_t timeout){
  if(ESP8266_SetConnectionMux(1)==FAILURE) return FAILURE;
  if(ESP8266_EnableServer(port)==FAILURE) return FAILURE;
  if(ESP8266_SetServerTimeout(timeout)==FAILURE) return FAILURE; 
  return SUCCESS;
}

//-------------------ESP8266_StopServer --------------
// Stop server and set to single-client mode
// Inputs: none
// Outputs: 1 on success, 0 on failure
int ESP8266_StopServer(void){
  if(ESP8266_DisableServer()==FAILURE) return FAILURE;
  if(ESP8266_SetConnectionMux(0)==FAILURE) return FAILURE;
  return SUCCESS;
}

//----------ESP8266_Reset------------
// Soft resets the esp8266 module
// Input:  none
// Output: 1 if success, 0 if fail
int ESP8266_Reset(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+RST\r\n");
    if(ESP8266_WaitForResponse(ESP8266_READY_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}

//---------ESP8266_Restore-----
// Restore the ESP8266 module to default values
// Inputs: none
// Outputs: 1 if success, 0 if fail
int ESP8266_Restore(void) { int try=MAXTRY;
  while(try){
  	ESP8266_SendCommand("AT+RESTORE\r\n");
    if(ESP8266_WaitForResponse(ESP8266_READY_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}


//---------ESP8266_GetVersionNumber----------
// Get status
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_GetVersionNumber(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+GMR\r\n");
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return 0; // fail
}

//---------ESP8266_GetMACAddress----------
// Get MAC address
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_GetMACAddress(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CIPSTAMAC?\r\n");
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return 0; // fail
}

