Mikail-Sadic-UT/POV-Globe/Firmware/src/Drivers/src/esp8266_full.c
//---------ESP8266_SetWifiMode----------
// Configures the esp8266 to operate as a wifi client, access point, or both
// Input: mode accepts ESP8266_WIFI_MODE constants
// Output: 1 if success, 0 if fail 
int ESP8266_SetWifiMode(uint8_t mode){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CWMODE=%d\r\n", mode);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}
 
//---------ESP8266_SetConnectionMux----------
// Enables the esp8266 connection mux, required for starting tcp server
// Input: 0 (single) or 1 (multiple)
// Output: 1 if success, 0 if fail 
int ESP8266_SetConnectionMux(uint8_t enabled){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPMUX=%d\r\n", enabled);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) {
      ESP8266_ConnectionMux = enabled;
      return SUCCESS;
    }
    try--;
  }
  return FAILURE;
}

//---------ESP8266_ListAccessPoints----------
// Lists available wifi access points
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_ListAccessPoints(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CWLAP\r\n");
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

//----------ESP8266_JoinAccessPoint------------
// Joins a wifi access point using specified ssid and password
// Input:  SSID and PASSWORD
// Output: 1 if success, 0 if fail
int ESP8266_JoinAccessPoint(const char* ssid, const char* password){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CWJAP=\"");
    ESP8266_SendCommand(ssid);
    ESP8266_SendCommand("\",\"");
    ESP8266_SendCommand(password);
    ESP8266_SendCommand("\"\r\n");    
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_FAIL_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}

// ----------ESP8266_QuitAccessPoint-------------
// Disconnects from currently connected wifi access point
// Inputs: none
// Outputs: 1 if success, 0 if fail 
int ESP8266_QuitAccessPoint(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CWQAP\r\n");
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}

//----------ESP8266_ConfigureAccessPoint------------
// Configures esp8266 wifi soft access point settings
// Use this function only when in AP mode (and not in client mode)
// Input:  SSID, Password, channel, security
// Output: 1 if success, 0 if fail
int ESP8266_ConfigureAccessPoint(const char* ssid, const char* password, uint8_t channel, uint8_t encryptMode){
  int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    ESP8266_SendCommand("AT+CWSAP=\"");
    ESP8266_SendCommand(ssid);
    ESP8266_SendCommand("\",\"");
    ESP8266_SendCommand(password);
    sprintf(TXBuffer, "\",%d,%d\r\n", channel, encryptMode);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

//---------ESP8266_GetIPAddress----------
// Get local IP address
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_GetIPAddress(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CIFSR\r\n");   
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}

//---------ESP8266_SetSSLClientConfiguration----------
// Set SSL client configuration
// Requires certificates to be flashed into the ESP firmware
// Inputs: enable/disable client/server certificate checks
// output: 1 if success, 0 if fail 
int ESP8266_SetSSLClientConfiguration(int verifyClient, int verifyServer){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPSSLCCONF=%d\r\n", (verifyClient? 1 : 0) + (verifyServer? 2 : 0));
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

//---------ESP8266_SetSSLBufferSize----------
// Set SSL buffer size
// Inputs: buffer size between 2048 and 4096
// output: 1 if success, 0 if fail 
int ESP8266_SetSSLBufferSize(uint16_t bufferSize){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPSSLSIZE=%d\r\n", bufferSize);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

//---------ESP8266_MakeTCPConnection----------
// Establish TCP or SSL connection
// The ESP only seems to have limited SSL support, does not work with all servers
// Inputs: IP address or web page as a string, port, and keepalive time (0 if none)
// output: 1 if success, 0 if fail 
int ESP8266_MakeTCPConnection(char *IPaddress, uint16_t port, uint16_t keepalive, int ssl){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    if(ssl){
      ESP8266_SendCommand("AT+CIPSTART=\"SSL\",\"");
    } else {
      ESP8266_SendCommand("AT+CIPSTART=\"TCP\",\"");
    }
    ESP8266_SendCommand(IPaddress);
    if(keepalive) {
      sprintf(TXBuffer, "\",%d,%d\r\n", port, keepalive);
    } else {
      sprintf(TXBuffer, "\",%d\r\n", port);
    }
    ESP8266_SendCommand(TXBuffer);   // open and connect to a socket
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE; 
}

//---------ESP8266_Send----------
// Send a string to server 
// Input: payload to send
// Output: 1 if success, 0 if fail 
int ESP8266_Send(const char* fetch){
  char TXBuffer[32];
  if(ESP8266_ConnectionMux) {
    sprintf(TXBuffer, "AT+CIPSEND=%d,%d\r\n", 0, strlen(fetch));
  } else {
    sprintf(TXBuffer, "AT+CIPSEND=%d\r\n", strlen(fetch));
  }
  ESP8266_SendCommand(TXBuffer);  
  if(!ESP8266_WaitForResponse(">",ESP8266_ERROR_RESPONSE)) return FAILURE;
  ESP8266_SendCommand(fetch);
  if(ESP8266_WaitForResponse(ESP8266_SENDOK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
  return FAILURE; 
}

//---------ESP8266_SendBuffered----------
// Send a string to server using ESP TCP-send buffer
// Input: payload to send
// Output: 1 if success, 0 if fail 
int ESP8266_SendBuffered(const char* fetch){
  char TXBuffer[32];
  if(ESP8266_ConnectionMux) {
    sprintf(TXBuffer, "AT+CIPSENDBUF=%d,%d\r\n", 0, strlen(fetch));
  } else {
    sprintf(TXBuffer, "AT+CIPSENDBUF=%d\r\n", strlen(fetch));
  }
  ESP8266_SendCommand(TXBuffer);  
  if(!ESP8266_WaitForResponse(">",ESP8266_ERROR_RESPONSE)) return FAILURE;
  ESP8266_Segment++;
  ESP8266_SendCommand(fetch);
  sprintf(TXBuffer, "Recv %d bytes", strlen(fetch));
  if(ESP8266_WaitForResponse(TXBuffer,ESP8266_ERROR_RESPONSE)) return SUCCESS;
  return FAILURE; 
}

//---------ESP8266_SendBufferedStatus----------
// Check status of last buffered segment
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_SendBufferedStatus(void){
  char OKBuffer[16];
  char FailBuffer[24];
  if(ESP8266_ConnectionMux) {
    sprintf(OKBuffer, "\n%d,%d,SEND OK\r\n", 0, ESP8266_Segment);
    sprintf(FailBuffer, "\n%d,%d,SEND FAIL\r\n", 0, ESP8266_Segment);
  } else {
    sprintf(OKBuffer, "\n%d,SEND OK\r\n", ESP8266_Segment);
    sprintf(FailBuffer, "\n%d,SEND FAIL\r\n", ESP8266_Segment);
  }
  if(ESP8266_WaitForResponse(OKBuffer,FailBuffer)) return SUCCESS;
  return FAILURE; 
}

//---------ESP8266_Receive----------
// Receive a string from server 
// Reads from data input until end of line or max length is reached
// Input: buffer and max length
// Output: 1 and null-terminated string if success, 0 if fail (disconnected)
int ESP8266_Receive(char* fetch, uint32_t max){ long sr; const char* s;
  char letter;
  while(max > 1) {
    if(ESP8266Rx0Fifo_Size() || ESP8266_DataAvailable) { // data (about to be) available?
      while(ESP8266Rx0Fifo_Get(&letter) == FIFOFAIL){};
      // ESP8266_DisableInterrupt();  // critical section
      sr = StartCritical();  
      if(ESP8266_DataAvailable) ESP8266_DataAvailable--;
      EndCritical(sr); 
      // ESP8266_EnableInterrupt();         
      if(letter == '\r') continue;
      if(letter == '\n') break;
      *fetch = letter;
      fetch++;
      max--;
    } else {  // wait for next packet or connection close
      if(ESP8266_ConnectionMux) {
        s = "0,CLOSED";
      } else {
        s = "CLOSED";
      }
      if(!ESP8266_WaitForResponse(ReceiveDataSearchString,s)){
        *fetch = 0;       // connection closed
        return FAILURE;
      }
      while(ESP8266_InChar() != ':') {}  // wait for DataAvailable to be updated
    }        
  }
  *fetch = 0;  // terminate with null character
  return SUCCESS;
}

//---------ESP8266_CloseTCPConnection----------
// Close TCP connection 
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_CloseTCPConnection(void){ int try=MAXTRY;
  while(try){
    if(ESP8266_ConnectionMux) {
      ESP8266_SendCommand("AT+CIPCLOSE=0\r\n");
    } else {
      ESP8266_SendCommand("AT+CIPCLOSE\r\n");
    }      
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) {
      ESP8266Rx0Fifo_Init();  // Discard any data
      return SUCCESS;
    }
    try--;
  }
  ESP8266Rx0Fifo_Init();  // Discard any data
  return FAILURE;
}

//---------ESP8266_SetDataTransmissionMode----------
// Set data transmission passthrough mode
// Input: 0 not data mode, 1 data mode; return "Link is builded" 
// Output: 1 if success, 0 if fail 
int ESP8266_SetDataTransmissionMode(uint8_t mode){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPMODE=%d\r\n", mode);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

