Mikail-Sadic-UT/POV-Globe/Firmware/src/Drivers/src/esp8266_full.c
//---------ESP8266_GetStatus----------
// Get network connection status
// Input: none
// Output: 1 if success, 0 if fail 
int ESP8266_GetStatus(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CIPSTATUS\r\n");
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

// --------ESP8266_EnableServer------------------
// Enables tcp server on specified port
// Inputs: port number
// Outputs: 1 if success, 0 if fail
int ESP8266_EnableServer(uint16_t port){  int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPSERVER=1,%d\r\n", port);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) {
      ESP8266_Server = port;
      return SUCCESS;
    }
    try--;
  }
  return FAILURE;
}

// ----------ESP8266_SetServerTimeout--------------
// Set connection timeout for tcp server, 0-28800 seconds
// Inputs: timeout parameter
// Outputs: 1 if success, 0 if fail
int ESP8266_SetServerTimeout(uint16_t timeout){ int try=MAXTRY;
  char TXBuffer[32];
  while(try){
    sprintf(TXBuffer, "AT+CIPSTO=%d\r\n", timeout);
    ESP8266_SendCommand(TXBuffer);
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,ESP8266_ERROR_RESPONSE)) return SUCCESS;
    try--;
  }
  return FAILURE;
}

// ----------ESP8266_WaitForConnection--------------
// Wait for incoming connection on server
// must ensure that no other ESP calls are done while waiting
// this should really be done in the background interrupt handler
// using a mailbox to communicate with this function
// Inputs: none
// Outputs: 1 if success, 0 if fail
int ESP8266_WaitForConnection(void){
  if(!ESP8266_ConnectionMux) return FAILURE;
  if(!ESP8266_Server) return FAILURE;
  if(ESP8266_WaitForResponse("0,CONNECT\r\n",0)) return SUCCESS;
  return FAILURE;
}

//---------ESP8266_DisableServer----------
// Disables tcp server
// Input: none 
// Output: 1 if success, 0 if fail 
int ESP8266_DisableServer(void){ int try=MAXTRY;
  while(try){
    ESP8266_SendCommand("AT+CIPSERVER=0\r\n"); 
    if(ESP8266_WaitForResponse(ESP8266_OK_RESPONSE,0)) {
      ESP8266_Server = 0;
      return SUCCESS;
    }
    try--;
  }
  return FAILURE;
}
